# 한번 계산된결과를 메모이제이션하기 위한 리스트 초기화
d = [0] * 100


# 피보나치 함수를 재귀함수로 구현(탑-다운 다이나믹 프로그래밍)
# 큰 문제를 해결하기 위해 작은 문제를 호출 -> 하향식
# 하지만 가능하면 재귀함수를 사용하는 탑다운 방식 보다는 보텀업 방식 권장.
# 시스템적으로 재귀함수 호출 범위가 한정되어 있을 수 있기 때문임.

def fibo(x):
    print('f(' + str(x) + ')', end=' ') # 호출 함수 확인

    # 종료 조건(1 혹은 2일때 1을 반환)
    if x == 1 or x == 2:
        return 1
    # 이미 계산한 적이 있는 문제라면 그대로 반환.
    if d[x] != 0:
        return d[x]
    # 아직 계산하지 않은 문제라면 점화식에 따라 피보나치 결과 반환.
    d[x] = fibo(x - 1) + fibo(x - 2)
    return d[x]


print(fibo(99))
